#1、请用代码实现如下进制的转换。
"""
#v1 = 675 二进制字符串类型
v1 = 675
v1= bin(675)  #是字符串类型
print(v1)

#v2 = "0b11000101"   转换十进制  整型
v2 = "0b11000101"
v2=int(v2,base=2)
print(v2)

#v3 = "1100101"    转换为十进制 整型
v3 = "1100101"
v3 = int(v3,base=2)
print(v3)
"""

#2、现有v1=123 v2=456 ,请将这两个值转换为二进制，并将其二进制中的前缀去掉，将两个二进制数拼接起来，转换为整型（十进制）
"""
v1 = 123
v2 = 456
v1 = bin(v1)
v2 = bin(v2)
v1 = v1.replace("0b","")
v2 = v2.replace("0b","")
v3 = v1+v2
v3 = int(v3,base=2)
print(v3)
"""

#3、现有v1=123 v2=456 ,请将这两个值转换为二进制，并将其二进制中的前缀去掉，再补足为2个字节（16位），将两个二进制数拼接起来，转换为整型（十进制）
v1 = 123
v2 = 456
v1 = bin(v1)
v2 = bin(v2)
v1 = v1.replace("0b","")
v2 = v2.replace("0b","")
v1 = v1.zfill(16)
v2 = v2.zfill(16)
v3 = v1+v2
v3 = int(v3,base=2)
print(v3)


#4、